MyHomeDev/src/AccumulationRegisters/мх_ПланированиеБюджета/мх_ПланированиеБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мх_ПланированиеБюджета</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБюджетНаДень</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиДоходов</types>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyHomeDev/src/AccumulationRegisters/мх_Расходы/мх_Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мх_Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнеБюджета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.мх_СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.мх_СтатьиРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

MyHomeDev/src/CommonModules/ПланированиеБюджетаСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОстатокБюджетаНаДату(Знач ДатаПроверки = Неопределено) Экспорт
	
	ОстатокБюджета = 0;
	
	Если НЕ ЗначениеЗаполнено(ДатаПроверки) Тогда
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;
	
	НачалоПериода = НачалоМесяца(ДатаПроверки);
	КонецПериода = КонецДня(ДатаПроверки);
	ГраницаКонецПериода = Новый Граница(КонецПериода, ВидГраницы.Включая);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ГраницаКонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаДата", КонецПериода);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланированиеБюджетаОбороты.СуммаБюджетНаДеньПриход + ПланированиеБюджетаОбороты.СуммаРасход КАК Сумма
	|ИЗ
	|	РегистрНакопления.мх_ПланированиеБюджета.Обороты(&НачалоПериода, &КонецПериода,,) КАК ПланированиеБюджетаОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-РасходыОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.мх_Расходы.Обороты(&НачалоПериода, &КонецПериода,,) КАК РасходыОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ISNULL(СУММА(мх_Расходы.Сумма), 0) КАК Сумма
	|ИЗ
	|	РегистрНакопления.мх_Расходы КАК мх_Расходы
	|ГДЕ
	|	мх_Расходы.Период МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И мх_Расходы.ВнеБюджета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОстатокБюджета = ОстатокБюджета + Выборка.Сумма;
	КонецЦикла;
	
	Возврат ОстатокБюджета;
	
КонецФункции

#КонецОбласти
